{
  "washerwoman": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/4/4d/Washerwoman_Token.png/540px-Washerwoman_Token.png",
    "shortDesc": "You start knowing that 1 of 2 players is a particular Townsfolk.",
    "desc": [
      "The Washerwoman learns that a specific Townsfolk is in play, but not who is playing it.",
      "  ○  During the first night, the Washerwoman is woken, shown two players, and learns the character of one of them.",
      "  ○  They learn this only once and then learn nothing more."
    ]
  },

  "librarian": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/8/86/Librarian_Token.png/540px-Librarian_Token.png",
    "shortDesc":  "You start knowing that 1 of 2 players is a particular Outsider. (Or that zero are in play.)",
    "desc": [
      "The Librarian learns that a specific Outsider is in play, but not who is playing it.",
      "  ○  During the first night, the Librarian learns that one of two players is a specific Outsider.",
      "  ○  They learn this only once and then learn nothing more.",
      "  ○  The Drunk is an Outsider. If the Librarian learns that 1 of 2 players is the Drunk, they do not learn the Townsfolk that the player thinks that they are."
    ]
  },
  "investigator": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/e/ec/Investigator_Token.png/540px-Investigator_Token.png",
    "shortDesc":  "You start knowing that 1 of 2 players is a particular Minion.",
    "desc": [
      "The Investigator learns that a specific Minion is in play, but not who is playing it.",
      "  ○  During the first night, the Investigator is woken and shown two players, but only learns the character of one of them.",
      "  ○  They learn this only once and then learn nothing more."
    ]
  },
  "chef": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/4/4c/Chef_Token.png/540px-Chef_Token.png",
    "shortDesc":  "You start knowing how many pairs of evil players there are.",
    "desc": [
      "The Chef learns if evil players are sitting next to each other.",
      "  ○  On the first night, the Chef learns exactly how many pairs there are in total. A pair is two players, but one player may be a part of two pairs. So, two players sitting next to each other count as one pair, three players sitting next to each other count as two pairs. Four players sitting next to each other count as three pairs. And so on.",
      "  ○  The Chef detects evil Travelers just like other character types, but only if those Travelers joined the game before the Chef acts."
    ]
  },
  "empath": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/6/61/Empath_Token.png/540px-Empath_Token.png",
    "shortDesc":  "Each night, you learn how many of your 2 alive neighbours are evil.",
    "desc": [
      "The Empath keeps learning whether their neighbors are evil.",
      "  ○  The Empath only learns how many of their neighbors are evil, not which one is evil.",
      "  ○  The Empath does not detect dead players. So, if the Empath is sitting next to a dead player, the information refers not to the dead player, but to the closest alive player in that direction.",
      "  ○  The Empath acts after the Demon, so if the Demon kills one of the Empath’s alive neighbors, the Empath does not learn about the now-dead player. The Empath's information is accurate at dawn, not at dusk."
    ]
  },
  "fortune_teller": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/3/3a/Fortune_Teller_Token.png/540px-Fortune_Teller_Token.png",
    "shortDesc":  "Teller Each night, choose 2 players: you learn if either is a Demon. There is 1 good player that registers falsely to you.",
    "desc": [
      "The Fortune Teller can detect who the Demon is, but sometimes thinks good players are Demons.",
      "  ○  Each night, the Fortune Teller chooses two players and learns if at least one of them is a Demon. They do not learn which of them is a Demon, just that one of them is. If neither is the Demon, they learn this instead.",
      "  ○  Unfortunately, one player, called the Red Herring, will register as a Demon to the Fortune Teller if chosen. The Red Herring is the same player throughout the entire game. This player may be any good player, even the Fortune Teller, and the Fortune Teller does not know which player it is.",
      "  ○  The Fortune Teller may choose any two players—alive or dead, or even themself. If they choose a dead Demon, then the Fortune Teller still receives a nod."
    ]
  },
  "undertaker": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/f/fe/Undertaker_Token.png/540px-Undertaker_Token.png",
    "shortDesc":  "Each night*, you learn which character died by execution today.",
    "desc": [
      "The Undertaker learns which character was executed today.",
      "  ○  The player must have died from execution for the Undertaker to learn who they are. Deaths during the day for other reasons, such as the Gunslinger choosing a player to kill, or the exile of a Traveler, do not count. Execution without death—rare as it is—does not count.",
      "  ○  The Undertaker wakes each night except the first, as there have been no executions yet.",
      "  ○  If nobody died by execution today, the Undertaker learns nothing. The Storyteller either does not wake the Undertaker at night, or wakes them but does not show a token.",
      "  ○  If the Drunk is executed, the Undertaker is shown the the Drunk character token, not the Townsfolk that the player thought they were."
    ]
  },
  "monk": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/1/1b/Monk_Token.png/540px-Monk_Token.png",
    "shortDesc":  "Each night*, choose a player (not yourself): they are safe from the Demon tonight.",
    "desc": [
      "The Monk protects other people from the Demon.",
      "  ○  Each night except the first, the Monk may choose to protect any player except themself.",
      "  ○  If the Demon attacks a player who has been protected by the Monk, then that player does not die. The Demon does not get to attack another player—there is simply no death tonight.",
      "  ○  The Monk does not protect against other harmful effects such as poisoning, drunkenness, or Outsider penalties. The Monk does not protect against the Demon nominating and executing someone."
    ]
  },
  "ravenkeeper": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/4/45/Ravenkeeper_Token.png/540px-Ravenkeeper_Token.png",
    "shortDesc":  "If you die at night, you are woken to choose a player: you learn their character.",
    "desc": [
      "The Ravenkeeper learns any player's character, but only if they die at night.",
      "  ○  The Ravenkeeper is woken on the night that they die, and chooses a player immediately.",
      "  ○  The Ravenkeeper may choose a dead player if they wish."
    ]
  },
  "virgin": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/5/5e/Virgin_Token.png",
    "shortDesc":  "The 1st time you are nominated, if the nominator is a Townsfolk, they are executed immediately.",
    "desc": [
      "The Virgin is safe from execution...perhaps. In the process, they confirm if their nominator is a Townsfolk.",
      "  ○  If a Townsfolk nominates the Virgin, then that Townsfolk is executed immediately. Because there can only be one execution per day, the nomination process immediately ends, even if a player was about to die.",
      "  ○  Only Townsfolk are executed due to the Virgin's ability. If an Outsider, Minion, or Demon nominates the Virgin, nothing happens, and voting continues.",
      "  ○  The Virgin’s ability is powerful because if a Townsfolk nominates them and dies, then both characters are almost certainly Townsfolk.",
      "  ○  After being nominated for the first time, the Virgin loses their ability, even if the nominator did not die, and even if the Virgin was poisoned or drunk."
    ]
  },
  "slayer": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/2/2f/Slayer_Token.png/540px-Slayer_Token.png",
    "shortDesc":  "Once per game, during the day, publicly choose a player: if they are the Demon, they die.",
    "desc": [
      "The Slayer can kill the Demon by guessing who it is.",
      "  ○  The Slayer can choose to use their ability at any time during the day, and must declare to everyone when they’re using it. If the Slayer chooses the Demon, the Demon dies immediately. Otherwise, nothing happens.",
      "  ○  The players do not learn the identity of the dead player. After all, it may have been the Recluse!",
      "  ○  When the Slayer declares that they wish to use their power, it is a good idea to give the group a minute or two to discuss who the Slayer should choose, but the Slayer makes the final decision.",
      "  ○  A Slayer that uses their ability while poisoned or drunk may not use it again.",
      "  ○  The Slayer will want to choose an alive player. Even if the Slayer chooses a dead Imp, nothing happens, because a dead player can’t die again."
    ]
  },
  "soldier": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/9/9e/Soldier_Token.png/540px-Soldier_Token.png",
    "shortDesc":  "You are safe from the Demon.",
    "desc": [
      "The Soldier cannot be killed by the Demon.",
      "  ○  The Soldier cannot die due to the Demon’s ability. So, if the Imp attacks the Soldier at night, nothing happens. Nobody dies. The Imp does not get to choose another player to attack instead.",
      "  ○  The Soldier can still die by execution, even if the nominator was the Demon. The Soldier is protected from the Demon’s ability to kill, not the actions of the Demon player.",
      "  ○  The Soldier is not protected from other harmful effects such as poisoning or drunkenness."
    ]
  },
  "mayor": {
    "set": "trouble-brewing",
    "type": "townsfolk",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/c/c4/Mayor_Token.png/540px-Mayor_Token.png",
    "shortDesc":  "If only 3 players live & no execution occurs, your team wins. If you die at night, another player might die instead.",
    "desc": [
      "The Mayor can win by peaceful means on the final day.",
      "  ○  To survive, the Mayor sometimes *accidentally* gets someone else killed. If the Mayor is attacked, you may choose that a different player dies. Nobody learns how the player died at night, just that they died.",
      "  ○  If there are just three players alive at the end of the day, and no execution occurred that day, then the Mayor wins, which means that the good team wins too.",
      "  ○  Travelers do count as players when counting for the Mayor’s victory, so they must be exiled first. Remember that exiles are not executions.",
      "  ○  Fabled don’t count as players when counting for the Mayor’s victory, as the Storyteller isn’t a player.",
      "  ○  If a player dies due to the Mayor’s ability, the Storyteller chooses a living player that can die tonight."
    ]
  },

  "butler": {
    "set": "trouble-brewing",
    "type": "outsider",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/1/1a/Butler_Token.png/540px-Butler_Token.png",
    "shortDesc":  "Each night, choose a player (not yourself): tomorrow, you may only vote if they are voting too.",
    "desc": [
      "The Butler may only vote when their Master votes.",
      "  ○  Each night, the Butler chooses a player to be their master. The next day, the Butler may only have their hand raised to vote if their master is voting too.",
      "  ○  If the master’s vote has not yet been tallied, but the master has their hand raised to vote, the Butler may also have their hand raised to vote. If the master has their hand down, the Butler must also have their hand down.",
      "  ○  If the master’s vote has already been tallied, the Butler may have their hand raised to vote if they wish.",
      "  ○  It is not the Storyteller’s responsibility to monitor the Butler. They’re responsible for their own voting. If they accidentally vote when they shouldn’t, the Storyteller will count the vote as normal. However, repeating this behavior is considered cheating.",
      "  ○  Because any player can vote for an exile, and exiles are never affected by abilities, the Butler can vote freely for an exile.",
      "  ○  The Butler may choose a dead player as their master, but will only be able to vote if that player has a vote token, because dead players may only raise their hand to vote if they have a vote token.",
      "  ○  The Butler is never forced to vote."
    ]
  },
  "drunk": {
    "set": "trouble-brewing",
    "type": "outsider",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/0/03/Drunk_Token.png/540px-Drunk_Token.png",
    "shortDesc":  "You do not know you are the Drunk. You think you are a Townsfolk, but your ability malfunctions.",
    "desc": [
      "The Drunk thinks they are a Townsfolk and has no idea that they are actually the Drunk.",
      "  ○  During setup, the Drunk's token does not go in the bag. Instead, a Townsfolk character token goes in the bag, and the player who draws that token is secretly the Drunk for the whole game. You know. They do not.",
      "  ○  The Drunk has no ability. Whenever their Townsfolk ability would affect the game in some way, it doesn't. However, you pretend they are the Townsfolk they think they are. If that character would wake at night, wake the Drunk instead and act as if they are the Townsfolk. If that Townsfolk would gain information, you may give them false information instead—and you’re encouraged to do so."
    ]
  },
  "recluse": {
    "set": "trouble-brewing",
    "type": "outsider",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/b/bb/Recluse_Token.png/540px-Recluse_Token.png",
    "shortDesc":  "You might register as evil & as a Minion or Demon, even if dead.",
    "desc": [
      "The Recluse might appear evil but is actually good.",
      "  ○  Whenever the Recluse’s alignment is detected, the Storyteller chooses whether the Recluse registers as good or evil.",
      "  ○  Whenever the Recluse is targeted by an ability that affects specific Minions or Demons, the Storyteller chooses whether the Recluse registers as that specific Minion or Demon.",
      "  ○  The Recluse may register as either good or evil, or as an Outsider, Minion, or Demon, at different parts of the same night. The Storyteller chooses whatever is most interesting."
    ]
  },
  "saint": {
    "set": "trouble-brewing",
    "type": "outsider",
    "team": "good",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/7/77/Saint_Token.png/540px-Saint_Token.png",
    "shortDesc":  "If you die by execution, your team loses.",
    "desc": [
      "The Saint ends the game if they are executed.",
      "  ○  If the Saint dies by execution, the game ends. Good loses and evil wins.",
      "  ○  If the Saint dies in any way other than execution—such as the Demon killing them—then the game continues."
    ]
  },

  "poisoner": {
    "set": "trouble-brewing",
    "type": "minion",
    "team": "evil",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/a/af/Poisoner_Token.png/540px-Poisoner_Token.png",
    "shortDesc":  "Each night, choose a player: their ability malfunctions tonight and tomorrow day.",
    "desc": [
      "The Poisoner secretly disrupts character abilities.",
      "  ○  Each night, the Poisoner chooses someone to poison for that night and the entire next day.",
      "  ○  A poisoned player has no ability, but you pretend they do. They do not affect the game in any real way. However, to keep up the illusion that the poisoned player is not poisoned, wake them at the appropriate time and go through the motions as if they were not poisoned. If their ability gives them information, you may give them false information.",
      "  ○  If a poisoned player uses a *once per game* ability while poisoned, they cannot use their ability again."
    ]
  },
  "spy": {
    "set": "trouble-brewing",
    "type": "minion",
    "team": "evil",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/3/31/Spy_Token.png/540px-Spy_Token.png",
    "shortDesc":  "Each night, you see the Grimoire. You might register as good & as a Townsfolk or Outsider, even if dead.",
    "desc": [
      "The Spy knows who everyone is and might appear good, but is actually evil.",
      "  ○  If any character has an ability that would detect or affect a good player, then the Spy might register as good to that character. If any character has an ability that detects Townsfolk or Outsiders, then the Spy might register as a specific Townsfolk or Outsider to that player. As always, it is your choice as to what the Spy registers as, even as many characters or both alignments during the same night.",
      "  ○  Remember to keep your Grimoire tidy, and show it to the Spy in the correct orientation, so the Spy can easily see who is who."
    ]
  },
  "baron": {
    "set": "trouble-brewing",
    "type": "minion",
    "team": "evil",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/7/7c/Scarlet_Woman_Token.png/540px-Scarlet_Woman_Token.png",
    "shortDesc":  "There are extra Outsiders in play. [+2 Outsiders]",
    "desc": [
      "The Baron changes the number of Outsiders in play.",
      "  ○  This change happens during setup, and does not revert if the Baron dies.",
      "  ○  The added Outsiders always replace Townsfolk, not other character types."
    ]
  },
  "scarlet_woman": {
    "set": "trouble-brewing",
    "type": "minion",
    "team": "evil",
    "image": "http://bloodontheclocktower.com/wiki/images/b/ba/Baron_Token.png",
    "shortDesc":  "Woman If there are 5 or more players alive (Travellers don’t count) & the Demon dies, you become the Demon.",
    "desc": [
      "The Scarlet Woman becomes the Demon when the Demon dies.",
      "  ○  If there are five or more players just before the Demon dies—that is, four or more players left alive after the Demon dies—then the Scarlet Woman immediately becomes the Demon, and the game continues as if nothing happened.",
      "  ○  Travelers do not count as players to see if the Scarlet Woman’s ability triggers.",
      "  ○  If less than five players were alive when the Demon is executed, then the game ends and good wins.",
      "  ○  If there are five or more players alive when the Demon dies at night, the Scarlet Woman must be the new Imp.",
      "  ○  If the Scarlet Woman becomes the Demon, they are that Demon in every way. Good wins if they are executed. They kill each night. They register as the Demon."
    ]
  },
  "imp": {
    "set": "trouble-brewing",
    "type": "demon",
    "team": "evil",
    "image": "http://bloodontheclocktower.com/wiki/images/thumb/4/42/Imp_Token.png/540px-Imp_Token.png",
    "shortDesc":  "Each night*, choose a player: they die. If you kill yourself this way, a Minion becomes the Imp.",
    "desc": [
      "The Imp kills at night and can make copies of itself...for a terrible price.",
      "  ○  On each night except the first, the Imp chooses a player to kill. Because most characters act after the Demon, that player will probably not get to use their ability tonight.",
      "  ○  The Imp, because it’s a Demon, knows which players are their Minions, and knows three not-in-play good characters that they can safely bluff as.",
      "  ○  If the Imp dies, the game ends and good wins. However, if the Imp kills themself at night, they die and an alive Minion becomes an Imp. This new Imp does not act that same night, but is now the Imp in every other way—they kill each night, and lose if they die.",
      "  ○  The Imp **must** choose a player to kill, but they can choose a dead player. If successful, no death is reported the following day."
    ]
  },


  "fool": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/b/ba/Fool_Token.png/540px-Fool_Token.png",
    "shortDesc": "The first time you die, you don't.",
    "desc": [
      "The Fool escapes death...once.",
      "  ○   The first time the Fool dies for any reason, the Fool remains alive. They don’t learn that their ability saved their life.",
      "  ○   If another character's ability protects the Fool from death, the Fool does not use their ability. Only the time that the Fool would actually for realsy bona fide be dead does the Fool’s ability trigger."
    ]
  },

  "grandmother": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/3/3a/Grandmother_Token.png/540px-Grandmother_Token.png",
    "shortDesc": "You start knowing a good player & character. If the Demon kills them, you die too.",
    "desc": [
      "The Grandmother knows who their Grandchild is, but if their Grandchild is killed by the Demon, the Grandmother dies too.",
      "  ○   During the first night, the Grandmother learns their Grandchild—a good player who is a Townsfolk or Outsider. The Grandchild does not learn that they have a Grandmother.",
      "  ○   If the Demon kills the Grandchild, the Grandmother dies too. If the Grandchild dies by any other means—such as execution, or another type of death at night—the Grandmother does not also die."
    ]
  },

  "moonchild": {
    "set": "bad-moon-rising",
    "type": "outsider",
    "team": "good",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/4/4c/Moonchild_Token.png/540px-Moonchild_Token.png",
    "shortDesc": "When you learn that you are dead, choose 1 alive player: if good, they die tonight.",
    "desc": [
      "The Moonchild curses somebody upon death, making them die too.",
      "  ○   The Moonchild must choose a player within a minute or two of learning that they are dead. This means they do this after they die by execution, or at dawn when the Storyteller declares who died at night. The Moonchild can take their time in making this decision, and get advice from the group before doing so, but the decision must be made.",
      "  ○   If the Moonchild chooses a good player, that player dies tonight. If they choose an evil player, nothing happens.",
      "  ○   As always, if an evil player is bluffing as the Moonchild, and pretends to use their Moonchild power, play along."
    ]
  },

  "devils_advocate": {
    "set": "bad-moon-rising",
    "type": "minion",
    "team": "evil",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/2/23/Devils_Advocate_Token.png/540px-Devils_Advocate_Token.png",
    "shortDesc": "Each night, choose a living player (not the same as last night): if executed tomorrow, they do not die.",
    "desc": [
      "The Devil's Advocate prevents players from dying by execution.",
      "  ○   Each night, the Devil’s Advocate chooses a player to protect from death by execution. The next day, if that player is executed, the execution succeeds but the player remains alive.",
      "  ○   The Devil’s Advocate cannot choose the same player two nights in a row, whether or not that player was saved from execution today, and they cannot choose a Zombuul that registers as dead."
    ]
  },

  "professor": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/a/ac/Professor_Token.png/540px-Professor_Token.png",
    "shortDesc": "Once per game, at night*, choose a dead player: if they are a Townsfolk, they are resurrected.",
    "desc": [
      "The Professor can bring someone back from the dead.",
      "  ○   Once per game, the Professor chooses a dead player. If that player is a Townsfolk, they are resurrected, becoming alive again.",
      "  ○   If the Professor chooses an Outsider, Minion, or Demon, then nothing happens, and the Professor's ability is gone.",
      "  ○   The resurrected player regains their ability, even a “once per game” ability they used already.",
      "  ○   Resurrected Townsfolk may or may not get to act on the night of their resurrection, depending on whether they would act before or after the Professor. If they had a “first night only” or “you start knowing” ability, they immediately wake to use it again, as soon as the Professor goes to sleep."
    ]
  },

  "sailor": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/0/01/Sailor_Token.png/540px-Sailor_Token.png",
    "shortDesc": "Each night, choose a living player: either you, or they, are drunk until dusk. You can not die.",
    "desc": [
      "The Sailor is either drunk or getting somebody else drunk While the Sailor is sober, they cannot die.",
      "  ○   Each night, the Sailor chooses a player, who will probably get drunk.",
      "  ○   If they choose themself, they lose their *cannot die* ability until they become sober.",
      "  ○   If they choose another player, you choose which player is drunk. If they choose a Townsfolk, the Storyteller will usually make the Townsfolk drunk, but if an Outsider, a Minion, or the Demon is chosen, then the Storyteller will usually make the Sailor the drunk one."
    ]
  },
  "tea_lady": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/e/e7/Tea_Lady_Token.png/540px-Tea_Lady_Token.png",
    "shortDesc": "If both your alive neighbours are good, they can not die.",
    "desc": [
      "The Tea Lady protects her neighbors from death...as long as they are good.",
      "  ○   If both alive neighbors of the Tea Lady are currently good, those neighbors cannot die. The Demon cannot kill them, nor the Godfather, nor the Gossip. If they are executed, they do not die. The only exception is the Assassin, who can kill someone protected from death.",
      "  ○   The Tea Lady’s alive neighbors are the two alive players closest to the Tea Lady—one clockwise and one counterclockwise. Skip past any dead neighbors. ",
      "  ○   However, if one or both of these alive neighbors is evil, then either may die. If the evil player dies, and the Tea Lady is now sitting next to 2 good players, neither can die."
    ]
  },

  "chambermaid": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "shortDesc": "Each night, choose 2 alive players (not yourself): you learn how many woke tonight due to their ability.",
    "desc": []
  },

  "exorcist": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "shortDesc": "Each night*, choose a player (not the same as last night): the Demon, if chosen, learns who you are & does not act tonight.",
    "desc": []
  },

  "innkeeper": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "shortDesc": "Each night*, choose 2 players: they can not die tonight, but 1 is drunk until dusk.",
    "desc": []
  },

  "gambler": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "shortDesc": "Each night*, choose a player & guess their character: if you guess wrong, you die.",
    "desc": []
  },

  "gossip": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "shortDesc": "Each day, you may make a public statement. Tonight, if it was true, a player dies.",
    "desc": []
  },

  "courtier": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "shortDesc": "Once per game, at night, choose a character: they are drunk for 3 nights & 3 days.",
    "desc": []
  },

  "minstrel": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "shortDesc": "If a Minion died today, all other players (except Travellers) are drunk from dusk until tomorrow dusk.",
    "desc": []
  },

  "pacifist": {
    "set": "bad-moon-rising",
    "type": "townsfolk",
    "team": "good",
    "shortDesc": "Executed good players might not die.",
    "desc": []
  },

  "tinker": {
    "set": "bad-moon-rising",
    "type": "outsider",
    "team": "good",
    "shortDesc": "You might die at any time.",
    "desc": []
  },

  "goon": {
    "set": "bad-moon-rising",
    "type": "outsider",
    "team": "good",
    "shortDesc": "Each night, the 1st player to choose you with their ability is drunk until dusk. You become their alignment.",
    "desc": []
  },

  "lunatic": {
    "set": "bad-moon-rising",
    "type": "outsider",
    "team": "good",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/5/56/Lunatic_Token.png/540px-Lunatic_Token.png",
    "shortDesc": "You think you are a Demon, but your abilities malfunction. The Demon knows who you are & whom you attack.",
    "desc": [
      "The Lunatic thinks that they are the Demon.",
      "  ○   Much like the Drunk, the Lunatic does not know their real character or real alignment. They are woken each night to attack as if they were the Demon that’s in play, but their choices have no effect because they have no Demon ability.",
      "  ○   The Lunatic wakes during the first night to learn 3 bluffs and the appropriate number of Minions, but this information may be wrong.",
      "  ○   The real Demon knows which players the Lunatic chose to attack each night."
    ]
  },
  
  "godfather": {
    "set": "bad-moon-rising",
    "type": "minion",
    "team": "evil",
    "shortDesc": "You start knowing which Outsiders are in play. If 1 died today, choose a player tonight: they die. [−1 or +1 Outsider]",
    "desc": []
  },

  "assassin": {
    "set": "bad-moon-rising",
    "type": "minion",
    "team": "evil",
    "shortDesc": "Once per game, at night*, choose a player: they die, even if for some reason they could not.",
    "desc": []
  },

  "mastermind": {
    "set": "bad-moon-rising",
    "type": "minion",
    "team": "evil",
    "shortDesc": "If the Demon dies by execution, play for 1 more day. If a player is then executed, their team loses.",
    "desc": []
  },

  "zombuul": {
    "set": "bad-moon-rising",
    "type": "demon",
    "team": "evil",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/c/c6/Zombuul_Token.png/540px-Zombuul_Token.png",
    "shortDesc": "Each night*, if no-one died today, choose a player: they die. The 1st time you die, you live but register as dead.",
    "desc": [
      "The Zombuul secretly remains alive while in the grave.",
      "  ○   When the Zombuul would die for any reason, it actually doesn’t die, but the Storyteller acts as if the player has died. The second time the Zombuul dies, it dies for real, and good wins.",
      "  ○   The seemingly dead Zombuul counts as a dead player in almost every way. The player’s life token on the Town Square flips to indicate their death. The next time they vote, they lose their vote token. They cannot nominate, they may vote with the Voudon, they’re not an alive neighbor for the Tea Lady, and so on. The only difference is that the game continues, the Zombuul still attacks, and the game continues if just 2 other players are alive.",
      "  ○   The Zombuul only wakes at night to attack if nobody died that day. If a dead player is executed, the player can’t die again, so the Zombuul would still wake.",
      "  ○   If a drunk or poisoned Zombuul dies, good wins. If a “dead” Zombuul becomes drunk or poisoned, the players are not told that the player is alive.",
      "",
      "NOTE: There's a lot of confusion about how zombuul's appearance of death works with other abilities. It depends on the storyteller, but here is my suggestion on how it should resolve:",
      "  ○   The once-killed zombuul should register as dead. Things that count dead players would count a once-killed zombuul, and this zombuul is not considered 'alive' for any other abilities.",
      "  ○   However, the once-killed zombuul did not actually 'die'. Undertaker gets no info after the zombuul is executed once because it did not die."
    ]
  },
  
  "pukka": {
    "set": "bad-moon-rising",
    "type": "demon",
    "team": "evil",
    "shortDesc": "Each night, choose a player: they are poisoned until tomorrow night, then die. You act on the first night.",
    "desc": []
  },

  "shabaloth": {
    "set": "bad-moon-rising",
    "type": "demon",
    "team": "evil",
    "shortDesc": "Each night*, choose 2 players: they die. A dead player you chose last night might be regurgitated.",
    "desc": []
  },

  "po": {
    "set": "bad-moon-rising",
    "type": "demon",
    "team": "evil",
    "shortDesc": "Each night*, you may choose a player: they die. If you chose no-one last night, choose 3 players tonight",
    "desc": []
  },

    "clockmaker": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "You start knowing how many steps from the Demon to nearest Minion.",
      "desc": []
  },
  "dreamer": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Each night, choose a player (not yourself): you learn 1 good character and 1 evil character, 1 of which is correct.",
      "desc": []
  },
  "snake_charmer": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Each night, choose an alive player: a chosen Demon swaps characters & alignments with you & is then poisoned.",
      "desc": []
  },
  "mathematician": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Each night, you learn how many players’ abilities worked abnormally (since dawn) due to another character's ability.",
      "desc": []
  },
  "flowergirl": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Each night*, you learn if the Demon voted today.",
      "desc": []
  },
  "town_crier": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Each night*, you learn if a Minion nominated today.",
      "desc": []
  },
  "oracle": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Each night*, you learn how many dead players are evil.",
      "desc": []
  },
  "savant": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Each day, you may visit the Storyteller to learn 2 things in private: 1 is true & 1 is false.",
      "desc": []
  },
  "seamstress": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Once per game, at night, choose 2 players (not yourself): you learn if they are the same alignment.",
      "desc": []
  },
  "philosopher": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Once per game, at night, choose a good character: become them. If you duplicate an in-play character, they are drunk.",
      "desc": []
  },
  "artist": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "Once per game, during the day, privately ask the Storyteller any yes/no question.",
      "desc": []
  },
  "juggler": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "On your 1st day, publicly guess up to 5 player's characters. That night, you learn how many you got correct.",
      "desc": []
  },
  "sage": { 
      "set": "sects-and-violets",
      "type": "townsfolk",
      "team": "good",
      "shortDesc": "If the Demon kills you, you learn that it is 1 of 2 players.",
      "desc": []
  },

  "mutant": { 
      "set": "sects-and-violets",
      "type": "outsider",
      "team": "good",
      "shortDesc": "If you are “mad” about being an Outsider, you might be executed.",
      "desc": []
  },
  "sweetheart": {
    "set": "sects-and-violets",
    "type": "outsider",
    "team": "good",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/3/34/Sweetheart_Token.png/540px-Sweetheart_Token.png",
    "shortDesc": "If you die, 1 player is drunk from now on.",
    "desc": [
      "The Sweetheart, when they die, makes someone drunk for the rest of the game.",
      "  ○   The Storyteller chooses which player becomes drunk.",
      "  ○   This ability works while the Sweetheart is dead."
    ]
  },
  "barber": { 
      "set": "sects-and-violets",
      "type": "outsider",
      "team": "good",
      "shortDesc": "If you die, tonight the Demon may choose 2 players to swap characters.",
      "desc": []
  },
  "klutz": { 
      "set": "sects-and-violets",
      "type": "outsider",
      "team": "good",
      "shortDesc": "When you learn that you died, publicly choose 1 alive player: if they are evil, your team loses.",
      "desc": []
  },

  "evil_twin": {
    "set": "sects-and-violets",
    "type": "minion",
    "team": "evil",
    "image": "https://bloodontheclocktower.com/wiki/images/2/24/Evil_Twin_Token.png",
    "shortDesc": "Twin You & an opposing player know each other. If the good player is executed, evil wins. Good can't win if you both live.",
    "desc": [
      "The Evil Twin mirrors a good character, and the players don'tknow which twin is good and which twin is evil.",
      "  ○   During the first night, the Evil Twin and a good player, called the Good Twin, wake to learn who each other are. If the Good Twin is executed, evil wins.",
      "  ○   If the Demon dies but both twins are still alive, the game continues. But... if the two Twins are the only two players left alive, not including Travelers, then evil wins just like it normally would.",
      "  ○   If a Pit-Hag creates an Evil Twin, a player of the opposing alignment becomes a twin."
    ]
  },
  "witch": {
    "set": "sects-and-violets",
    "type": "minion",
    "team": "evil",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/c/cc/Witch_Token.png/540px-Witch_Token.png",
    "shortDesc": "Each night, choose a player: if they nominate tomorrow, they die. If just 3 players live, you lose this ability.",
    "desc": [
      "The Witch curses players, so that they die if they nominate.",
      "  ○   Each night, the Witch chooses a player to curse. That player dies if they nominate any player on the next day, although their nomination still counts.",
      "  ○   The Witch’s curse lasts only for one day, but the Witch may curse the same player again and again each night.",
      "  ○   As soon as just three players are left alive, the Witch’s curse is immediately removed, and the Witch acts no more."
    ]
  },
  "cerenovus": { 
      "set": "sects-and-violets",
      "type": "minion",
      "team": "evil",
      "shortDesc": "Each night, choose a player & a good character: they are “mad” about being this character tomorrow, or might be executed.",
      "desc": []
  },
  "pit_hag": { 
      "set": "sects-and-violets",
      "type": "minion",
      "team": "evil",
      "shortDesc": "Each night*, choose a player & a character they become (if not-in-play). If a Demon is made, deaths tonight are arbitrary.",
      "desc": []
  },


  "fang_gu": {
    "set": "sects-and-violets",
    "type": "demon",
    "team": "evil",
    "image": "https://bloodontheclocktower.com/wiki/images/thumb/e/e6/Fang_Gu_Token.png/540px-Fang_Gu_Token.png",
    "shortDesc": "Each night*, choose a player: they die. The 1st Outsider chosen becomes an evil Fang Gu & you die instead. [+1 Outsider]",
    "desc": [
      "The Fang Gu possesses Outsiders.",
      "  ○   The first time a Fang Gu attacks an Outsider, the Fang Gu dies, and the Outsider becomes a Fang Gu and turns evil.",
      "  ○   This can only happen once per game. If the new Fang Gu attacks an Outsider, the Outsider dies as normal.",
      "  ○   The new Fang Gu counts as the Demon, and good wins if they die. They do not, however, learn which players are Minions.",
      "  ○   There is an extra Outsider in play."
    ]
  },

  "vigormortis": { 
      "set": "sects-and-violets",
      "type": "demon",
      "team": "evil",
      "shortDesc": "Each night*, choose a player: they die. Minions you kill keep their ability & poison 1 Townsfolk neighbour. [−1 Outsider]",
      "desc": []
  },
  "no_dashii": { 
      "set": "sects-and-violets",
      "type": "demon",
      "team": "evil",
      "shortDesc": "Each night*, choose a player: they die. Your 2 Townsfolk neighbours are poisoned.",
      "desc": []
  },
  "vortox": { 
      "set": "sects-and-violets",
      "type": "demon",
      "team": "evil",
      "shortDesc": "Each night*, choose a player; they die. Good abilities yield false information. Each day, if no-one was executed, evil wins.",
      "desc": []
   },

   "sentinel": {
      "set": "unknown",
      "type": "fabled",
      "team": "good",
      "image": "https://bloodontheclocktower.com/wiki/images/thumb/9/9d/Sentinel_Token.png/540px-Sentinel_Token.png",
      "shortDesc": "There might be 1 extra or 1 fewer Outsider in-play.",
      "desc": ["There might be 1 extra or 1 fewer Outsider in-play.", "The storyteller decides at the start of the game if they want to change the count of outsiders by one in either direction, or keep it the same."]
      
   }
  
}
